constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (100 0 0)
    (100 100 0)
    (0 100 0)
    
    (0 0 5)
    (100 0 5)
    (100 100 5)
    (0 100 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
			(0 1 5 4)
			(1 2 6 5)
			(3 0 4 7)
            (0 1 2 3)
            (4 5 6 7)
        );
    }
    
    atmosphere
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
