constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1 // water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}

phase2 // oil
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-04;
    rho             rho [ 1 -3 0 0 0 0 0 ] 900;
}

sigma               sigma [ 1 0 -2 0 0 0 0 ] 0.07;


//- Cahn-Hilliard model specific parameters

// limit for liquid alpha
filterAlpha        filterAlpha [ 0 0 0 0 0 0 0 ] 0.9;

// Capillary width
thickness          thickness [ 0 1 0 0 0 0 0 ] 1e-5;

// Reduced temperature parameter
Tr                 Tr [ 0 0 0 0 0 0 0 ] 0;

mobilityCourant    mobilityCourant [ 0 0 0 0 0 0 0 ] 0.001;

// Angle for interface slope calculations in grad
theta              theta [ 0 0 0 0 0 0 0 ] 60;

// ************************************************************************* //
