system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    root            "./system"
    case            "test.case";
    instance        "system";
    local           "";
    class           dictionary;
    object          funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
    GaussianNoise
    {
        field           alpha1;
        expression      "(alpha1==1) ? (randNormal() > 0.0 ? 0.55 : 0.45) : 0";
        keepPatches     1;
    }
);

// ************************************************************************* //
